{
  "en": {
    "100": "Success",
    "101": "Missing required fields.",
    "102": "Invalid data",
    "110": "Partial amount approved",
    "150": "General system failure",
    "151": "The request was received but there was a server timeout. This error does not include timeouts between the client and the server",
    "152": "The request was received, but a service did not finish running in time",
    "200": "The authorization request was approved by the issuing bank but declined by CyberSource because it did not pass the AVS check",
    "201": "The issuing bank has questions about the request. You will not receive an authorization code programmatically, but you can obtain one verbally by calling the processor.",
    "202": "Expired card",
    "203": "General decline of the card. No other information provided by the issuing bank.",
    "204": "Insufficient funds in the account.",
    "205": "Stolen or lost card.",
    "207": "Issuing bank unavailable.",
    "208": "Inactive card or card not authorized for card-not-present transactions.",
    "209": "American Express Card Identification Digits (CIDs) did not match.",
    "210": "The card has reached the credit limit.",
    "211": "Invalid card verification number.",
    "220": "The processor declined the request based on a general issue with the customer’s account.",
    "221": "The customer matched an entry on the processor’s negative file.",
    "222": "The customer’s bank account is frozen.",
    "230": "The authorization request was approved by the issuing bank but declined by CyberSource because it did not pass the CVN check.",
    "231": "Invalid account number.",
    "232": "The card type is not accepted by the payment processor.",
    "233": "General decline by the processor.",
    "234": "There is a problem with your CyberSource merchant configuration.",
    "236": "Processor failure.",
    "240": "The card type sent is invalid or does not correlate with the card number.",
    "242": "The request ID is invalid.",
    "250": "The request was received, but there was a timeout at the payment processor.",
    "500": "Unexpected error."
  },
  "es": {
    "100": "Éxito",
    "101": "Falta campo requerido.",
    "102": "Datos invalidos",
    "110": "Cantidad parcial aprobada",
    "150": "Falla general en el sistema",
    "151": "Se recibió la solicitud pero hubo un tiempo de espera del servidor. Este error no incluye tiempos de espera entre el cliente y el servidor",
    "152": "Se recibió la solicitud, pero un servicio no terminó de ejecutarse a tiempo",
    "200": "La solicitud de autorización fue aprobada por el banco emisor, pero CyberSource la rechazó porque no pasó el cheque AVS",
    "201": "El banco emisor tiene preguntas sobre la solicitud. No recibirá un código de autorización programáticamente, pero puede obtener uno verbalmente llamando al procesador.",
    "202": "Tarjeta expirada",
    "203": "Declinación general de la tarjeta. Ninguna otra información proporcionada por el banco emisor.",
    "204": "Fondos insuficientes en la cuenta.",
    "205": "Tarjeta robada o perdida.",
    "207": "Banco emisor no disponible.",
    "208": "Tarjeta inactiva o tarjeta no autorizada para transacciones con tarjeta no presente.",
    "209": "Los dígitos de identificación de tarjetas American Express (CID) no coincidieron.",
    "210": "La tarjeta ha alcanzado el límite de crédito.",
    "211": "Número de verificación de tarjeta no válido.",
    "220": "El procesador rechazó la solicitud debido a un problema general con la cuenta del cliente.",
    "221": "El cliente hizo coincidir una entrada en el archivo negativo del procesador.",
    "222": "La cuenta bancaria del cliente está congelada.",
    "230": "La solicitud de autorización fue aprobada por el banco emisor, pero CyberSource la rechazó porque no pasó el cheque de CVN.",
    "231": "Número de cuenta inválido",
    "232": "El procesador de pagos no acepta el tipo de tarjeta.",
    "233": "Disminución general por parte del procesador.",
    "234": "Hay un problema con la configuración de su comerciante CyberSource.",
    "236": "Fallo del procesador.",
    "240": "El tipo de tarjeta enviado no es válido o no se correlaciona con el número de tarjeta.",
    "242": "El código de autorizacion es invalido.",
    "250": "Se recibió la solicitud, pero hubo un tiempo de espera en el procesador de pagos.",
    "500": "Error inesperado."
  }
}
